saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.TM4C_DFP.1.1.0.pdsc
      <!-- *************************  Device 'TM4C1294NCPDT'  ***************************** -->
      <device Dname="TM4C1294NCPDT">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C1294NCPDT"/>
        <debug      svd="SVD/TM4C129/TM4C1294NCPDT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1294NCZAD'  ***************************** -->
      <device Dname="TM4C1294NCZAD">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C1294NCZAD"/>
        <debug      svd="SVD/TM4C129/TM4C1294NCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1297NCZAD'  ***************************** -->
      <device Dname="TM4C1297NCZAD">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C1297NCZAD"/>
        <debug      svd="SVD/TM4C129/TM4C1297NCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1299KCZAD'  ***************************** -->
      <device Dname="TM4C1299KCZAD">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C1299KCZAD"/>
        <debug      svd="SVD/TM4C129/TM4C1299KCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x080000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_512.FLM"    start="0x00000000"  size="0x080000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C1299NCZAD'  ***************************** -->
      <device Dname="TM4C1299NCZAD">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C1299NCZAD"/>
        <debug      svd="SVD/TM4C129/TM4C1299NCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129CNCPDT'  ***************************** -->
      <device Dname="TM4C129CNCPDT">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C129CNCPDT"/>
        <debug      svd="SVD/TM4C129/TM4C129CNCPDT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129CNCZAD'  ***************************** -->
      <device Dname="TM4C129CNCZAD">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C129CNCZAD"/>
        <debug      svd="SVD/TM4C129/TM4C129CNCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129DNCPDT'  ***************************** -->
      <device Dname="TM4C129DNCPDT">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C129DNCPDT"/>
        <debug      svd="SVD/TM4C129/TM4C129DNCPDT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129DNCZAD'  ***************************** -->
      <device Dname="TM4C129DNCZAD">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C129DNCZAD"/>
        <debug      svd="SVD/TM4C129/TM4C129DNCZAD.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_1024.FLM"   start="0x00000000"  size="0x100000"                 default="1"/>
      </device>

      <!-- *************************  Device 'TM4C129EKCPDT'  ***************************** -->
      <device Dname="TM4C129EKCPDT">
        <compile header="Device/Include/TM4C129/TM4C129.h"  define="TM4C129EKCPDT"/>
        <debug      svd="SVD/TM4C129/TM4C129EKCPDT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x080000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x040000"   init   ="0"   default="1"/>
        <algorithm  name="Flash/TM4C129_512.FLM"    start="0x00000000"  size="0x080000"                 default="1"/>
      </device>

